img_mj_start_message = '''*Активирован режим графических задач — пишите ваш запрос✅*

Рекомендуем ознакомиться с инструкцией'''


img_mj_instruction_message = '''*Полезная информация для работы с Midjourney*

✅Наш бот работает на 5\-ой, самой продвинутой, версии Midjourney

🇺🇸 Запрос можно писать на любом языке: он переведет его на английский через chatGPT

🔸Формулируйте запрос максимально конкретно\. Опишите главные объекты, окружение, стиль изображения\.

*Хороший пример подробного запроса можно найти тут👇*
https://t\.me/chat\_bot\_v\_tg/118

⏳Генерация изображения может занимать от 2 до 10 минут, в зависимости от нагрузки на сеть

🔞Бот не принимает запросы связанные с насилием, эротикой и темами 18\+\. Это ограничение самого Midjourney\.

🔎На канале мы выкладываем кейсы по использованию бота\. Посты про Midjourney отмечены тегом \#графика👇
https://t\.me/chat\_bot\_v\_tg/15

——————

*Что за кнопки под изображением?⚙️*

\* U \= Отделить выбранное фото и улучшить качество
\* V \= Сделать еще 4 варианта конкретного изображения
\* 1,2,3,4 \= Слева направо, сверху вниз — номера картинок
\* 🔄 \= Полностью переделать варианты'''


img_mj_instruction4pro = '''
🔹*Можете использовать генератора запросов, пример:*
https://prompt\.noonshot\.com

🔸*Как им пользоваться\. Видео c 6:36*
https://youtu\.be/RBB1UJOw36w?t\=396

*P\.S\.*
Если используете генератор промптов, то “/imagine prompt” — добавлять в сообщение не нужно'''

wait_msg = 'Пожалуйста дождитесь ответа на прошлый запрос'

request_accepted = '✅ Запрос принят!'

img_done = 'Готово ✅'